In [14]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split

In [1]:

dataset = pd.read_csv("C:\Users\anura\OneDrive\Desktop\ml assigenment\Assignment3\Mall_Customers.csv")
dataset.head()

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (1469072804.py, line 1)

In [9]:
dataset.tail()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [10]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [11]:
dataset.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [12]:
dataset.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [13]:
dataset.shape

(200, 5)

In [15]:
dataset.nunique()

CustomerID                200
Genre                       2
Age                        51
Annual Income (k$)         64
Spending Score (1-100)     84
dtype: int64

In [16]:
dataset['Gender'] = dataset['Genre']

In [17]:
dataset.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)  Gender
0           1    Male   19                  15                      39    Male
1           2    Male   21                  15                      81    Male
2           3  Female   20                  16                       6  Female
3           4  Female   23                  16                      77  Female
4           5  Female   31                  17                      40  Female

In [18]:
dataset['Genre'].value_counts()

Genre
Female    112
Male       88
Name: count, dtype: int64

In [19]:
dataset.drop(columns=['Genre'], inplace=True)

In [20]:
dataset.head()

   CustomerID  Age  Annual Income (k$)  Spending Score (1-100)  Gender
0           1   19                  15                      39    Male
1           2   21                  15                      81    Male
2           3   20                  16                       6  Female
3           4   23                  16                      77  Female
4           5   31                  17                      40  Female

In [21]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Age                     200 non-null    int64
 2   Annual Income (k$)      200 non-null    int64
 3   Spending Score (1-100)  200 non-null    int64
 4   Gender                  200 non-null    object
dtypes: int64(4), object(1)
memory usage: 7.9+ KB